%% 思考与实验

%% 思考题

% 思考题1.1：将矩阵A的第2-5行中的第1、3、5列元素赋给矩阵B
A_1 = rand(5, 6);             % 生成5行6列的随机矩阵A_1
B_1 = A_1(2:5, [1, 3, 5]);

% 思考题1.2：删除矩阵A的7号元素
A_1(7) = [];

% 思考题1.3：矩阵A_1的每个元素都加30
A_1 = A_1 + 30;

% 思考题1.4：求矩阵A的大小和维度
size_A = size(A_1);   % 大小
dim_A = ndims(A_1);   % 维度

% 思考题1.5：将向量t中值为0的元素用NaN代替
t = linspace(0, 100, 100);  % 生成100的行向量
t(t == 0) = NaN;

% 思考题1.6：将含有12个元素的向量x转换成3×4的矩阵
vec = 1:12;                 % 12个元素的行向量
vec_t = reshape(vec, 3, 4);

% 思考题1.7：建立储存3个单词的字符数组ch0和储存3个单词的字符串数组str0
ch0 = ['zhexin', 'is', 'handsome'];
str0 = ["zhexin", "is", "handsome"];

% 思考题1.8：建立储存1位同学姓名、百米跑时间的结构体变量s
s.name = '小明';
s.runtime = 10.00;


% 思考题2：已知A矩阵，请完成以下操作
A_2 = [97, 67, 34, 10;
    -78, 75, 65, 5;
    32, 5, -23, -59;
    0, -12, 54, 7];

% 思考题2.1：取出A的前三行构成矩阵B，前两列构成矩阵C，右下角3×2子矩阵构成矩阵D，B与C的乘积构成矩阵E
B_2 = A_2(1:3, :);
C_2 = A_2(:, 1:2);
D_2 = A_2(end-2:end, end-1:end);    % 通过end和索引来取子矩阵元素
E = B_2 * C_2;

% 思考题2.2：输出[50, 100]范围内的全部元素
element = A_2(A_2 >= 50 & A_2 <= 100);


%% 实验题（题干略，见教材P40）

% 实验题1
x1 = -74;
y1 = -27;
result1 = sin(x1^2 + y1^2) / (sqrt(tan(abs(x1 + y1))) + pi);

% 实验题2
a2 = 1 + 2i;
b2 = 3 + 4i;
c2 = exp(pi/6 * 1i);
result2 = c2 + a2 * b2 / (a2 + b2);

% 实验题3
a3 = -3.0;  % 分别替换成-2.9、-2.8、……、2.8、2.9、3.0试试
result3 = exp(-0.3 * a3) * sin(a3 + 0.3);

% 实验题4
x4 = [2, 4; -0.45, 5];
result4 = 0.5 * log(x4 + sqrt(1 + x4^2));

% 实验题5
A5 = [3, 54, 2;
      34, -45, 7;
      87, 90, 15];
B5 = [1, -2, 67;
      2, 8, 74;
      9, 3, 0];

% 实验题5.1
result5_1_1 = A5 * B5;
result5_1_2 = A5 .* B5;

% 实验题5.2
result5_2_1 = A5^3;
result5_2_2 = A5.^3;

% 实验题5.3
result5_3_1 = A5/B5;
result5_3_2 = B5\A5;

% 实验题5.4
result5_4_1 = [A5, B5];
result5_4_2 = [A5(1:3,:); B5^2];
